Examinator/src/Catalogs/ТерминыЭлектронныхГлоссариев/ТерминыЭлектронныхГлоссариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыЭлектронныхГлоссариев</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Определение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОпределение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыЭлектронныхГлоссариев/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа Тогда

		Если Справочники.ТерминыЭлектронныхГлоссариев.ПредставлениеСодержитЗапрещенныеСимволы(Наименование) Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Наименование"));
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Представление термина не должно содержать символы %1 или быть пустой строкой'"), 
				Справочники.ТерминыЭлектронныхГлоссариев.ЗапрещенныеСимволыСтрокой()
			);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"Наименование",,Отказ);
		КонецЕсли;
		
		Для каждого СтрокаТЧС Из Синонимы Цикл
			Если Справочники.ТерминыЭлектронныхГлоссариев.ПредставлениеСодержитЗапрещенныеСимволы(СтрокаТЧС.Представление) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Представление синонима не должно содержать символы %1 или быть пустой строкой'"), 
					Справочники.ТерминыЭлектронныхГлоссариев.ЗапрещенныеСимволыСтрокой()
				);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
				Возврат;
			КонецЕсли;			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;		
		
	РазработкаЭлектронныхКурсовСлужебный.ПроверитьВозможностьЗаписиЭлементаПередЗаписью(ЭтотОбъект, Отказ);
	РазработкаЭлектронныхКурсовСлужебный.УстановитьДатуИзмененияПередЗаписью(ЭтотОбъект, Отказ);
	
	Если НЕ ЭтоГруппа Тогда
		
		БукваДляПоиска = ВРег(БукваДляПоиска);
		
		Для каждого СтрокаТС Из Синонимы Цикл
			СтрокаТС.БукваДляПоиска = ВРег(СтрокаТС.БукваДляПоиска);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
